Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# list.filter.project.visibility.internal
source: Internal
zh_hans: 内部
zh_hant: 內部

# list.filter.project.visibility.private
source: Private
zh_hans: 私有
zh_hant: 私有

# list.filter.project.visibility.public
source: Public
zh_hans: 公开
zh_hant: 公開

# nav.insights
source: Insights
zh_hans: 洞察
zh_hant: 洞察

# onboarding.dataContribution.anonymity
source: GitHub Stars are public data. Before upload, Starcat removes account identity and uses a random anonymous identifier.
zh_hans: GitHub Star 本身是公开数据。上传前，Starcat 会移除账号身份，并使用随机匿名标识。

# onboarding.dataContribution.decline
source: Not Now
zh_hans: 暂不参与

# onboarding.dataContribution.githubLink
source: Review the Source Code on GitHub
zh_hans: 在 GitHub 查看源码

# onboarding.dataContribution.introduction
source: You can anonymously contribute public Star data to help Starcat train more relevant repository recommendations.
zh_hans: 你可以选择匿名贡献公开 Star 数据，帮助 Starcat 训练更相关的仓库推荐。

# onboarding.dataContribution.openSource
source: Still have concerns? Starcat is open source, so you can review the data collection and upload implementation on GitHub.
zh_hans: 仍有顾虑？Starcat 已开源，你可以在 GitHub 审核数据采集与上传实现。

# onboarding.dataContribution.privacy
source: Private repositories, tags, notes, search and browsing history, READMEs, code, GitHub account details, and Tokens are never uploaded.
zh_hans: 不会上传私有仓库、标签、笔记、搜索与浏览记录、README、代码、GitHub 账号或 Token。

# onboarding.dataContribution.save
source: Save and Continue
zh_hans: 保存并继续

# onboarding.dataContribution.title
source: Help Improve Repository Recommendations
zh_hans: 帮助改进仓库推荐

# onboarding.dataContribution.toggle
source: Anonymously contribute public Star data
zh_hans: 匿名贡献公开 Star 数据

# onboarding.dataContribution.uploadScope
source: Only public repository IDs and Star times are uploaded after a successful full Stars sync.
zh_hans: 仅在 Stars 全量同步成功后上传公开仓库 ID 和 Star 时间。

# project.access.alreadyInstalled
source: Already installed? Authorize
zh_hans: 已安装，继续授权
zh_hant: 已安裝，繼續授權

# project.access.authorize
source: Continue authorization
zh_hans: 继续授权
zh_hant: 繼續授權

# project.access.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# project.access.checkInstallation
source: Check GitHub App installation
zh_hans: 检查 GitHub App 安装状态
zh_hant: 檢查 GitHub App 安裝狀態

# project.access.connect
source: Connect GitHub App
zh_hans: 连接 GitHub App
zh_hant: 連接 GitHub App

# project.access.copyCode
source: Copy device code
zh_hans: 复制设备代码
zh_hant: 複製裝置代碼

# project.access.deviceCode
source: Device code
zh_hans: 设备代码
zh_hant: 裝置代碼

# project.access.disconnect
source: Disconnect
zh_hans: 断开连接
zh_hant: 中斷連接

# project.access.disconnect.confirm.action
source: Revoke and disconnect
zh_hans: 撤销并断开
zh_hant: 撤銷並中斷

# project.access.disconnect.confirm.detail
source: This revokes your authorization of Starcat for GitHub and invalidates project access in other Starcat installations. The GitHub App remains installed on personal and organization accounts.
zh_hans: 这会撤销当前 GitHub 用户对 Starcat for GitHub 的授权，并使其他 Starcat 安装中的项目权限失效。个人和组织中的 GitHub App 仍会保留。
zh_hant: 這會撤銷目前 GitHub 使用者對 Starcat for GitHub 的授權，並使其他 Starcat 安裝中的專案權限失效。個人和組織中的 GitHub App 仍會保留。

# project.access.disconnect.confirm.title
source: Revoke GitHub App authorization?
zh_hans: 撤销 GitHub App 授权？
zh_hant: 撤銷 GitHub App 授權？

# project.access.disconnect.reauthorize
source: Reauthorize and disconnect
zh_hans: 重新授权并断开
zh_hant: 重新授權並中斷

# project.access.install
source: Install GitHub App
zh_hans: 安装 GitHub App
zh_hant: 安裝 GitHub App

# project.access.manage
source: Manage project access
zh_hans: 管理项目授权
zh_hant: 管理專案授權

# project.access.openGitHub
source: Open GitHub authorization
zh_hans: 打开 GitHub 授权页
zh_hant: 開啟 GitHub 授權頁

# project.access.openGitHub.hint
source: Opens GitHub in your default browser to approve read-only project access.
zh_hans: 在默认浏览器中打开 GitHub，以批准只读项目权限。
zh_hant: 在預設瀏覽器中開啟 GitHub，以批准唯讀專案權限。

# project.access.permissions.contents.detail
source: Used to display README and other authorized content.
zh_hans: 用于展示 README 等已授权仓库内容。
zh_hant: 用於顯示 README 等已授權儲存庫內容。

# project.access.permissions.contents.title
source: Read repository contents
zh_hans: 读取仓库内容
zh_hant: 讀取儲存庫內容

# project.access.permissions.metadata.detail
source: Names, visibility, Stars, and other repository information.
zh_hans: 名称、可见性、Star 等仓库信息。
zh_hant: 名稱、可見性、Star 等儲存庫資訊。

# project.access.permissions.metadata.title
source: Read repository metadata
zh_hans: 读取仓库 Metadata
zh_hant: 讀取儲存庫 Metadata

# project.access.permissions.noWrite
source: No permission to write, delete, or administer repositories.
zh_hans: 不会获得写入、删除或管理仓库的权限。
zh_hant: 不會取得寫入、刪除或管理儲存庫的權限。

# project.access.permissions.selection.detail
source: Grant access to all repositories or only selected repositories.
zh_hans: 可以授权全部仓库，也可以只选择指定仓库。
zh_hant: 可以授權全部儲存庫，也可以只選擇指定儲存庫。

# project.access.permissions.selection.title
source: You choose the repository scope
zh_hans: 授权范围由你决定
zh_hant: 授權範圍由你決定

# project.access.permissions.title
source: GitHub will request the following
zh_hans: 接下来 GitHub 会请求
zh_hant: 接下來 GitHub 會請求

# project.access.privateCache.clear
source: Clear
zh_hans: 清理
zh_hant: 清理

# project.access.privateCache.cleared
source: Private README cache cleared.
zh_hans: Private README 缓存已清理。
zh_hant: Private README 快取已清理。

# project.access.privateCache.detail
source: Removes downloaded Private README content only. Projects and user data are preserved.
zh_hans: 仅移除已下载的 Private README，项目和用户数据会保留。
zh_hant: 僅移除已下載的 Private README，專案和使用者資料會保留。

# project.access.privateCache.failed
source: Could not clear the Private README cache.
zh_hans: 无法清理 Private README 缓存。
zh_hant: 無法清理 Private README 快取。

# project.access.privateCache.title
source: Local Private cache
zh_hans: 本地 Private 缓存
zh_hant: 本機 Private 快取

# project.access.reauthorize
source: Reauthorize
zh_hans: 重新授权
zh_hant: 重新授權

# project.access.refresh
source: Refresh projects
zh_hans: 刷新项目
zh_hant: 重新整理專案

# project.access.state.awaiting.detail
source: Complete installation and read-only authorization in GitHub. Starcat will update automatically after the callback.
zh_hans: 请在 GitHub 中完成安装和只读授权，回到 Starcat 后会自动更新。
zh_hant: 請在 GitHub 中完成安裝和唯讀授權，回到 Starcat 後會自動更新。

# project.access.state.awaiting.title
source: Waiting for authorization
zh_hans: 等待授权
zh_hant: 等待授權

# project.access.state.connected.detail
source: Authorized Public, Private, and Internal projects can now be synchronized.
zh_hans: 现在可以同步已授权的 Public、Private 和 Internal 项目。
zh_hant: 現在可以同步已授權的 Public、Private 和 Internal 專案。

# project.access.state.connected.title
source: GitHub App connected
zh_hans: GitHub App 已连接
zh_hant: GitHub App 已連接

# project.access.state.connecting.detail
source: Preparing the GitHub App installation and authorization page.
zh_hans: 正在准备 GitHub App 安装与授权页面。
zh_hant: 正在準備 GitHub App 安裝與授權頁面。

# project.access.state.connecting.title
source: Connecting
zh_hans: 正在连接
zh_hant: 正在連接

# project.access.state.disconnected.detail
source: Only Public projects are currently synchronized through your Starcat login.
zh_hans: 当前仅通过 Starcat 登录同步 Public 项目。
zh_hant: 目前僅透過 Starcat 登入同步 Public 專案。

# project.access.state.disconnected.title
source: Connect GitHub App
zh_hans: 连接 GitHub App
zh_hant: 連接 GitHub App

# project.access.state.disconnectionFailed.detail
source: Local credentials are preserved. Check your network and retry, or manage the authorization on GitHub.
zh_hans: 本机凭据仍已保留。请检查网络后重试，或前往 GitHub 管理授权。
zh_hant: 本機憑據仍已保留。請檢查網路後重試，或前往 GitHub 管理授權。

# project.access.state.disconnectionFailed.title
source: Could not revoke GitHub authorization
zh_hans: 无法撤销 GitHub 授权
zh_hant: 無法撤銷 GitHub 授權

# project.access.state.disconnectReauthorizationRequired.detail
source: The saved token has expired. Reauthorize once and Starcat will immediately finish revoking the GitHub grant.
zh_hans: 已保存的 token 过期。重新授权一次后，Starcat 会立即完成 GitHub grant 撤销。
zh_hant: 已儲存的 token 已過期。重新授權一次後，Starcat 會立即完成 GitHub grant 撤銷。

# project.access.state.disconnectReauthorizationRequired.title
source: Reauthorization required to disconnect
zh_hans: 需要重新授权后断开
zh_hant: 需要重新授權後中斷

# project.access.state.expired.detail
source: Reconnect to resume Private and Internal project refreshes.
zh_hans: 重新连接后才能继续刷新 Private 和 Internal 项目。
zh_hant: 重新連接後才能繼續重新整理 Private 和 Internal 專案。

# project.access.state.expired.title
source: Authorization expired
zh_hans: 授权已过期
zh_hant: 授權已過期

# project.access.state.failed.detail
source: The request failed without exposing repository or token details. Try again.
zh_hans: 请求失败，未暴露仓库或 token 详情，请重试。
zh_hant: 請求失敗，未暴露儲存庫或 token 詳情，請重試。

# project.access.state.failed.title
source: Authorization failed
zh_hans: 授权失败
zh_hant: 授權失敗

# project.access.state.installationCheckFailed.detail
source: The credential is saved, but GitHub could not confirm the installation. Check your network and retry.
zh_hans: 授权凭据已保存，但 GitHub 暂时无法确认安装状态。请检查网络后重试。
zh_hant: 授權憑據已儲存，但 GitHub 暫時無法確認安裝狀態。請檢查網路後重試。

# project.access.state.installationCheckFailed.title
source: Installation check failed
zh_hans: 安装状态检查失败
zh_hant: 安裝狀態檢查失敗

# project.access.state.installationRequired.detail
source: Install the GitHub App on a personal account or organization, then check again. Organization access may require administrator approval.
zh_hans: 请将 GitHub App 安装到个人账号或组织后重新检查；组织权限可能需要管理员批准。
zh_hant: 請將 GitHub App 安裝到個人帳號或組織後重新檢查；組織權限可能需要管理員批准。

# project.access.state.installationRequired.title
source: GitHub App installation required
zh_hans: 需要安装 GitHub App
zh_hant: 需要安裝 GitHub App

# project.access.state.offline.detail
source: Existing local projects are preserved. Reconnect to the network and retry.
zh_hans: 现有本地项目已保留，请恢复网络后重试。
zh_hant: 現有本機專案已保留，請恢復網路後重試。

# project.access.state.offline.title
source: Offline
zh_hans: 网络不可用
zh_hant: 網路不可用

# project.access.state.partial.detail
source: Only selected repositories are authorized, or some organizations have not granted access. Available projects remain usable.
zh_hans: 当前仅授权指定仓库，或部分组织尚未批准；已有项目仍可继续使用。
zh_hant: 目前僅授權指定儲存庫，或部分組織尚未批准；已有專案仍可繼續使用。

# project.access.state.partial.title
source: Partial authorization
zh_hans: 部分授权
zh_hant: 部分授權

# project.access.state.pending.detail
source: An organization administrator must approve the GitHub App request.
zh_hans: 需要组织管理员批准 GitHub App 请求。
zh_hant: 需要組織管理員批准 GitHub App 請求。

# project.access.state.pending.title
source: Organization approval pending
zh_hans: 等待组织审批
zh_hant: 等待組織審批

# project.access.state.revoked.detail
source: GitHub revoked this project credential. Your Starcat login and local user data are unchanged.
zh_hans: GitHub 已撤销项目凭据，Starcat 登录和本地用户数据不受影响。
zh_hant: GitHub 已撤銷專案憑據，Starcat 登入和本機使用者資料不受影響。

# project.access.state.revoked.title
source: Authorization revoked
zh_hans: 授权已撤销
zh_hant: 授權已撤銷

# project.access.state.unavailable.detail
source: This build has no complete GitHub App Client ID, Client Secret, and slug configuration. Public projects still use the existing OAuth login.
zh_hans: 当前构建未完整配置 GitHub App Client ID、Client Secret 和 slug，Public 项目仍使用现有 OAuth 登录。
zh_hant: 目前建置未完整設定 GitHub App Client ID、Client Secret 和 slug，Public 專案仍使用現有 OAuth 登入。

# project.access.state.unavailable.title
source: Private access is not configured
zh_hans: 未配置 Private 权限
zh_hant: 未設定 Private 權限

# project.access.step.authorize.detail
source: Authorize read-only access during installation, then Starcat verifies the installation automatically.
zh_hans: 安装期间完成只读授权，随后 Starcat 会自动验证安装状态。
zh_hant: 安裝期間完成唯讀授權，隨後 Starcat 會自動驗證安裝狀態。

# project.access.step.authorize.title
source: Authorize Starcat
zh_hans: 授权 Starcat
zh_hant: 授權 Starcat

# project.access.step.install.detail
source: Choose a personal account or organization, then grant all or selected repositories.
zh_hans: 选择个人账号或组织，并授权全部仓库或指定仓库。
zh_hant: 選擇個人帳號或組織，並授權全部儲存庫或指定儲存庫。

# project.access.step.install.title
source: Install and select repositories
zh_hans: 安装并选择仓库
zh_hant: 安裝並選擇儲存庫

# project.access.subtitle
source: Optional read-only access for Private and Internal repositories
zh_hans: 用于 Private 和 Internal 仓库的可选只读权限
zh_hant: 用於 Private 和 Internal 儲存庫的可選唯讀權限

# project.access.title
source: Project Access
zh_hans: 项目权限
zh_hant: 專案權限

# project.card.growth30d
source: %@ / 30d
zh_hans: 30 天 %@
zh_hant: 30 天 %@

# rag.browser.chunk.indexHelp
source: Embedding status for the current model.
zh_hans: 当前模型的向量化状态。

# rag.browser.chunk.indexLabel
source: Index
zh_hans: 索引

# rag.browser.chunk.libraryHelp
source: Whether this chunk is still in the knowledge base and searchable. Independent of embedding status.
zh_hans: 分片是否仍在知识库中、可被检索；与向量化是否完成无关。

# rag.browser.chunk.libraryLabel
source: Chunk
zh_hans: 分片

# rag.browser.overview.refresh
source: Rebuild the knowledge index and re-embed pending, failed, and stale shards
zh_hans: 重建知识库索引并重新向量化待处理、失败和过期分片

# rag.browser.repositoryInsights.available
source: Available
zh_hans: 可用

# rag.browser.repositoryInsights.copy
source: Copy Insights XML
zh_hans: 复制洞察 XML

# rag.browser.repositoryInsights.delete.action
source: Delete XML
zh_hans: 删除 XML

# rag.browser.repositoryInsights.delete.failed
source: Could not delete the insights XML. The existing artifact is still available.
zh_hans: 无法删除洞察 XML，现有产物仍然保留。

# rag.browser.repositoryInsights.delete.message
source: Only the generated XML artifact will be deleted. Repository insight data and caches will remain available.
zh_hans: 只会删除生成的 XML 产物，不会删除仓库洞察数据与缓存。

# rag.browser.repositoryInsights.delete.title
source: Delete repository insights XML?
zh_hans: 删除仓库洞察 XML？

# rag.browser.repositoryInsights.download
source: Download Insights XML
zh_hans: 下载洞察 XML

# rag.browser.repositoryInsights.download.action
source: Download
zh_hans: 下载

# rag.browser.repositoryInsights.download.panelTitle
source: Download Repository Insights XML
zh_hans: 下载仓库洞察 XML

# rag.browser.repositoryInsights.generate
source: Generate Insights XML
zh_hans: 生成洞察 XML

# rag.browser.repositoryInsights.generation.failed
source: Could not generate repository insights XML.
zh_hans: 无法生成仓库洞察 XML。

# rag.browser.repositoryInsights.regenerate
source: Regenerate Insights XML
zh_hans: 重新生成洞察 XML

# rag.browser.repositoryInsights.stat
source: Insights XML
zh_hans: 洞察 XML

# rag.browser.repositoryInsights.title
source: Repository Insights XML
zh_hans: 仓库洞察 XML

# rag.browser.retrieval.scope.followPlan
source: Current plan
zh_hans: 按当前计划

# rag.browser.retrieval.scope.followPlanDisabled
source: Ask a question in the RAG workspace first
zh_hans: 请先在 RAG 工作台问一轮

# rag.browser.retrieval.scope.hint.followPlan
source: Uses the latest Q&A candidate window. The test query is still the original sentence.
zh_hans: 复用最近一轮问答的候选窗口，检索句仍用测试框原文。

# rag.browser.retrieval.scope.hint.indexOracle
source: Searches the whole knowledge base and skips the Query Planner. This is not the Q&A path.
zh_hans: 全库检索且不走 Query Planner，不能代表工作台问答路径。

# rag.browser.retrieval.scope.indexOracle
source: Index recall
zh_hans: 索引召回

# rag.workspace.citation.knowledgeBaseMetadata
source: Knowledge base metadata
zh_hans: 知识库元数据

# rag.workspace.citation.section.activityQuality
source: Activity and quality
zh_hans: 活跃度与质量

# rag.workspace.citation.section.indexCoverage
source: Index coverage
zh_hans: 索引覆盖

# rag.workspace.citation.section.indexHealth
source: RAG index health
zh_hans: RAG 索引健康度

# rag.workspace.citation.section.knowledgeArtifacts
source: Knowledge artifacts
zh_hans: 知识产物

# rag.workspace.citation.section.organization
source: Organization
zh_hans: 整理情况

# rag.workspace.citation.section.scope
source: Knowledge base scope
zh_hans: 知识库范围

# rag.workspace.citation.section.starLeaders
source: Star leaders
zh_hans: 高星仓库

# rag.workspace.citation.section.technology
source: Technology distribution
zh_hans: 技术分布

# rag.workspace.context.repositoryInsights
source: Repository insights
zh_hans: 仓库洞察

# rag.workspace.debug.stage.repositoryInsightsLoad
source: Repository insights load
zh_hans: 仓库洞察读取

# rag.workspace.debug.stage.repositoryInsightsProjection
source: Repository insights projection
zh_hans: 仓库洞察投影

# rag.workspace.debug.stage.repositoryInsightsRequest
source: Repository insights request
zh_hans: 仓库洞察请求

# rag.workspace.execution.repositoryInsights.completedFormat
source: Used insights from %lld repositories
zh_hans: 已使用 %lld 个仓库的洞察

# rag.workspace.execution.repositoryInsights.preparedFormat
source: Prepared %1$lld of %2$lld repository insight artifacts
zh_hans: 已准备 %1$lld / %2$lld 个仓库洞察产物

# rag.workspace.execution.repositoryInsights.projecting
source: Fitting repository insights to the context window
zh_hans: 正在按上下文窗口投影仓库洞察

# rag.workspace.execution.repositoryInsights.promptNotEnabled
source: The current prompt does not enable repository insights
zh_hans: 当前提示词未启用仓库洞察

# rag.workspace.execution.repositoryInsights.title
source: Repository insights
zh_hans: 仓库洞察

# rag.workspace.execution.repositoryInsights.tokensFormat
source: Sent %1$lld repository insight documents (%2$lld tokens)
zh_hans: 已发送 %1$lld 份仓库洞察（%2$lld tokens）

# rag.workspace.execution.repositoryInsights.unavailable
source: No usable repository insights
zh_hans: 暂无可用仓库洞察

# rag.workspace.index.issues.openChunk
source: Open in knowledge base and locate this chunk
zh_hans: 打开知识库并定位到该分片

# rag.workspace.inspector.matchType.hybrid
source: Hybrid (FTS5 + vector)
zh_hans: 混合检索（FTS5 + 向量）

# rag.workspace.inspector.matchType.keyword
source: Keyword (FTS5)
zh_hans: 关键词检索（FTS5）

# rag.workspace.inspector.matchType.structured
source: Structured database facts
zh_hans: 结构化数据库事实

# rag.workspace.inspector.matchType.vector
source: Vector
zh_hans: 向量检索

# rag.workspace.inspector.metadata.group.insights
source: Insights summary
zh_hans: 洞察摘要

# rag.workspace.inspector.metadata.insights.archivedUnavailable
source: Archived · unavailable
zh_hans: 已归档 · 不可访问

# rag.workspace.inspector.metadata.insights.dormant
source: Dormant for over 1 year
zh_hans: 超过 1 年未活跃

# rag.workspace.inspector.metadata.insights.organized
source: Organized coverage
zh_hans: 整理覆盖

# rag.workspace.inspector.metadata.insights.qualityCoverage
source: Health · OpenSSF coverage
zh_hans: 健康度 · OpenSSF 覆盖

# rag.workspace.inspector.metadata.insights.risks
source: Maintenance · security risk
zh_hans: 维护 · 安全风险

# rag.workspace.inspector.plan.analytics.dimension.license
source: License
zh_hans: 许可证

# rag.workspace.inspector.plan.analytics.dimension.topic
source: Topic
zh_hans: 技术主题

# rag.workspace.inspector.plan.analytics.measure.repositoriesArchived
source: Archived repositories
zh_hans: 已归档仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesDormant
source: Dormant repositories
zh_hans: 长期未活跃仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesOrganized
source: Organized repositories
zh_hans: 已整理仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesUnavailable
source: Unavailable repositories
zh_hans: 不可访问仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesUnread
source: Unread repositories
zh_hans: 未读仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesUntagged
source: Untagged repositories
zh_hans: 未打标签仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesWithHealthSnapshot
source: Repositories with health data
zh_hans: 已有健康度数据的仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesWithMaintenanceRisk
source: Repositories with maintenance risk
zh_hans: 存在维护风险的仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesWithOpenSSFScore
source: Repositories with OpenSSF scores
zh_hans: 已有 OpenSSF 评分的仓库

# rag.workspace.inspector.plan.analytics.measure.repositoriesWithSecurityRisk
source: Repositories with security risk
zh_hans: 存在安全风险的仓库

# rag.workspace.inspector.plan.repositoryInsights
source: Repository insights
zh_hans: 仓库洞察

# rag.workspace.inspector.plan.retrieval.detail.hitKind.repositoryInsights
source: Repository insights
zh_hans: 仓库洞察

# rag.workspace.inspector.retrievalScore.formula.repositoryInsights
source: Repository-level structured evidence; it is not ranked as an indexed chunk.
zh_hans: 仓库级结构化证据，不参与索引分片排序。

# rag.workspace.inspector.structuredPreview
source: Used fact fragment
zh_hans: 使用的事实片段

# rag.workspace.prompt.compatibility.customized
source: Customized
zh_hans: 已自定义

# rag.workspace.prompt.compatibility.default
source: Default
zh_hans: 默认

# rag.workspace.prompt.compatibility.duplicatedHint
source: Repeated section placeholders may send the same runtime context to the model more than once. Compare with the default prompt and edit it manually.
zh_hans: 重复的 Section 占位符可能让同一份运行时上下文多次发送给模型，请对照默认提示词手动修改。

# rag.workspace.prompt.compatibility.duplicatedMessageFormat
source: This custom prompt repeats %lld placeholder(s).
zh_hans: 当前自定义提示词存在 %lld 个重复占位符。

# rag.workspace.prompt.compatibility.limited
source: Limited
zh_hans: 能力受限

# rag.workspace.prompt.compatibility.messageFormat
source: This custom prompt is missing %lld current placeholder(s). Related context will not be sent to the model.
zh_hans: 当前自定义提示词缺少 %lld 个新版占位符，相关上下文不会发送给模型。

# rag.workspace.prompt.compatibility.repositoryInsights
source: Repository insights will still be generated, but they will not be included in RAG prompts.
zh_hans: 仓库洞察仍会生成，但不会注入 RAG 提示词。

# rag.workspace.prompt.compatibility.restore
source: Restore This Tab
zh_hans: 恢复此页默认

# rag.workspace.prompt.default.copySystem
source: Copy default system prompt
zh_hans: 复制默认 System Prompt

# rag.workspace.prompt.default.copyUser
source: Copy default user prompt
zh_hans: 复制默认 User Prompt

# rag.workspace.prompt.default.description
source: Read-only reference for the current tab. Viewing or copying it does not change your prompt.
zh_hans: 当前页面的只读参考。查看或复制不会修改你的提示词。

# rag.workspace.prompt.default.open
source: Default Prompt
zh_hans: 默认提示词

# rag.workspace.prompt.default.openHelp
source: View the default prompt for comparison
zh_hans: 查看默认提示词并进行对比

# rag.workspace.prompt.default.title
source: Default Prompt
zh_hans: 默认提示词

# rag.workspace.prompt.placeholder.deepThinkingEnabled
source: Whether deep thinking with RepoContext is enabled for this turn
zh_hans: 本轮是否启用基于 RepoContext 的深度思考

# rag.workspace.prompt.placeholder.repositoryInsightsSection
source: Repository insights XML for explicitly selected or retained repositories. It uses a separate budget, is never vectorized, and is empty when no valid artifact is available.
zh_hans: 显式选择或最终保留仓库的洞察 XML；使用独立预算、不做向量化，没有有效产物时为空。

# rag.workspace.prompt.placeholder.webSearchEnabled
source: Whether public web search is enabled for this turn
zh_hans: 本轮是否启用公开网络搜索

# rag.workspace.repositoryInsights.copy
source: Copy repository insights XML
zh_hans: 复制仓库洞察 XML

# rag.workspace.repositoryInsights.generatedAt
source: Generated
zh_hans: 生成时间

# rag.workspace.repositoryInsights.historyUnavailable
source: The XML used for this answer is no longer available because the artifact was deleted or updated.
zh_hans: 本次回答使用的 XML 已删除或更新，无法回放原始正文。

# rag.workspace.repositoryInsights.projection
source: Window fit
zh_hans: 窗口适配

# rag.workspace.repositoryInsights.projection.original
source: Full XML
zh_hans: 完整 XML

# rag.workspace.repositoryInsights.projection.projected
source: Structurally reduced
zh_hans: 已按结构精简

# rag.workspace.repositoryInsights.reason
source: Reason
zh_hans: 原因

# rag.workspace.repositoryInsights.reason.artifactUnavailable
source: No valid locally cached repository insights XML is available
zh_hans: 本地没有可用的仓库洞察 XML

# rag.workspace.repositoryInsights.reason.contextWindowUnavailable
source: The current model context window could not fit a valid repository insights projection
zh_hans: 当前模型上下文窗口无法容纳合法的仓库洞察投影

# rag.workspace.repositoryInsights.reason.modelContextWindow
source: Structurally reduced to fit the current model context window
zh_hans: 已按结构精简以适配当前模型上下文窗口
